name: "preprocess"
backend: "python"
max_batch_size: 64

input [
  {
    name: "INPUT_0"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]

output [
  {
    name: "OUTPUT_0"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]

instance_group {
  count: 4
  kind: KIND_GPU
}

dynamic_batching {
}
